["The first computer bug was an actual moth found in a Harvard Mark II computer in 1947.", "The word 'bug' in computer terminology is often credited to Grace Hopper, a pioneer in computer programming.", "The programming language COBOL was initially designed to resemble English to make it more accessible.", "The first video game to use 3D graphics was Lunar Lander, released in 1969.", "The internet was originally created as a military project called ARPANET.", "The first computer mouse was invented by Douglas Engelbart in 1964.", "The term 'hacker' originally referred to a skilled computer programmer, not necessarily someone with malicious intent.", "The programming language Python was named after the British comedy group Monty Python.", "JavaScript was originally called LiveScript.", "The world's first computer virus, the Creeper virus, was created in 1971.", "The first computer to beat a human at chess was IBM's Deep Blue in 1997.", "The programming language C++ was originally called 'C with Classes'.", "The first mobile phone call was made in 1973 by Martin Cooper.", "The term 'software' was coined by John W. Tukey in 1958.", "The first computer to be sold commercially was the UNIVAC I in 1951.", "The programming language Java was originally called Oak.", "The internet's domain name system (DNS) was invented by Paul Mockapetris in 1983.", "The first video game console was the Magnavox Odyssey, released in 1972.", "The programming language Ruby was inspired by Perl, Smalltalk, and Eiffel.", "The first computer to use a graphical user interface (GUI) was the Xerox Alto in 1973.", "The world's first email was sent in 1971 by Ray Tomlinson.", "The programming language PHP was originally created for personal use by Rasmus Lerdorf.", "The first web browser was created by Tim Berners-Lee in 1990.", "The programming language Swift was developed by Apple.", "The first smartphone was the IBM Simon, released in 1992.", "The programming language Rust was developed by Mozilla.", "The first computer to play chess was the Manchester University Computer in 1952.", "The programming language Kotlin was developed by JetBrains.", "The first computer virus to spread widely was the ILOVEYOU worm in 2000.", "The programming language Go was developed by Google.", "The first video game to be played online was Maze War, released in 1973.", "The programming language Scala was developed by Martin Odersky.", "The first computer to break a million-dollar chess grandmaster was Deep Blue in 1996.", "The programming language Dart was developed by Google.", "The first computer to play checkers was the Christopher, created in 1952.", "The programming language Elixir was inspired by Erlang.", "The first computer to be used for scientific calculations was the ENIAC in 1946.", "The programming language Haskell was developed by a group of researchers.", "The first computer virus to infect a mobile phone was the Cabir virus in 2004.", "The programming language Clojure was inspired by Lisp.", "The first computer to be used for business applications was the UNIVAC I.", "The programming language F# was developed by Microsoft.", "The first computer to be used for weather forecasting was the ENIAC.", "This is a test fact about computers"]